Revit 2027 API
ThermalAsset.EqualsThermalOnly Method
 Determines whether this thermal asset is equal to another, but ignore data from base class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EqualsThermalOnly(
	ThermalAsset other
)
Public Function EqualsThermalOnly (
	other As ThermalAsset
) As Boolean
public:
bool EqualsThermalOnly(
	ThermalAsset^ other
)
member EqualsThermalOnly :
        other : ThermalAsset -> bool
Parameters
other ThermalAsset
 The thermal asset to compare with this one.
Return Value
Boolean
 True if the given thermal asset is equal to this one, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace